Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz2025dah169.h
#define _ADCIMCON2_SIGN31_POSITION               0x0000001E
#define _ADCIMCON2_SIGN31_MASK                   0x40000000
#define _ADCIMCON2_SIGN31_LENGTH                 0x00000001

#define _ADCIMCON2_DIFF31_POSITION               0x0000001F
#define _ADCIMCON2_DIFF31_MASK                   0x80000000
#define _ADCIMCON2_DIFF31_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN32_POSITION               0x00000000
#define _ADCIMCON3_SIGN32_MASK                   0x00000001
#define _ADCIMCON3_SIGN32_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF32_POSITION               0x00000001
#define _ADCIMCON3_DIFF32_MASK                   0x00000002
#define _ADCIMCON3_DIFF32_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN33_POSITION               0x00000002
#define _ADCIMCON3_SIGN33_MASK                   0x00000004
#define _ADCIMCON3_SIGN33_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF33_POSITION               0x00000003
#define _ADCIMCON3_DIFF33_MASK                   0x00000008
#define _ADCIMCON3_DIFF33_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN34_POSITION               0x00000004
#define _ADCIMCON3_SIGN34_MASK                   0x00000010
#define _ADCIMCON3_SIGN34_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF34_POSITION               0x00000005
#define _ADCIMCON3_DIFF34_MASK                   0x00000020
#define _ADCIMCON3_DIFF34_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN35_POSITION               0x00000006
#define _ADCIMCON3_SIGN35_MASK                   0x00000040
#define _ADCIMCON3_SIGN35_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF35_POSITION               0x00000007
#define _ADCIMCON3_DIFF35_MASK                   0x00000080
#define _ADCIMCON3_DIFF35_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN36_POSITION               0x00000008
#define _ADCIMCON3_SIGN36_MASK                   0x00000100
#define _ADCIMCON3_SIGN36_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF36_POSITION               0x00000009
#define _ADCIMCON3_DIFF36_MASK                   0x00000200
#define _ADCIMCON3_DIFF36_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN37_POSITION               0x0000000A
#define _ADCIMCON3_SIGN37_MASK                   0x00000400
#define _ADCIMCON3_SIGN37_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF37_POSITION               0x0000000B
#define _ADCIMCON3_DIFF37_MASK                   0x00000800
#define _ADCIMCON3_DIFF37_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN38_POSITION               0x0000000C
#define _ADCIMCON3_SIGN38_MASK                   0x00001000
#define _ADCIMCON3_SIGN38_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF38_POSITION               0x0000000D
#define _ADCIMCON3_DIFF38_MASK                   0x00002000
#define _ADCIMCON3_DIFF38_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN39_POSITION               0x0000000E
#define _ADCIMCON3_SIGN39_MASK                   0x00004000
#define _ADCIMCON3_SIGN39_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF39_POSITION               0x0000000F
#define _ADCIMCON3_DIFF39_MASK                   0x00008000
#define _ADCIMCON3_DIFF39_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN40_POSITION               0x00000010
#define _ADCIMCON3_SIGN40_MASK                   0x00010000
#define _ADCIMCON3_SIGN40_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF40_POSITION               0x00000011
#define _ADCIMCON3_DIFF40_MASK                   0x00020000
#define _ADCIMCON3_DIFF40_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN41_POSITION               0x00000012
#define _ADCIMCON3_SIGN41_MASK                   0x00040000
#define _ADCIMCON3_SIGN41_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF41_POSITION               0x00000013
#define _ADCIMCON3_DIFF41_MASK                   0x00080000
#define _ADCIMCON3_DIFF41_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN42_POSITION               0x00000014
#define _ADCIMCON3_SIGN42_MASK                   0x00100000
#define _ADCIMCON3_SIGN42_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF42_POSITION               0x00000015
#define _ADCIMCON3_DIFF42_MASK                   0x00200000
#define _ADCIMCON3_DIFF42_LENGTH                 0x00000001

#define _ADCIMCON3_SIGN43_POSITION               0x00000016
#define _ADCIMCON3_SIGN43_MASK                   0x00400000
#define _ADCIMCON3_SIGN43_LENGTH                 0x00000001

#define _ADCIMCON3_DIFF43_POSITION               0x00000017
#define _ADCIMCON3_DIFF43_MASK                   0x00800000
#define _ADCIMCON3_DIFF43_LENGTH                 0x00000001

#define _ADCGIRQEN1_AGIEN0_POSITION              0x00000000
#define _ADCGIRQEN1_AGIEN0_MASK                  0x00000001
#define _ADCGIRQEN1_AGIEN0_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN1_POSITION              0x00000001
#define _ADCGIRQEN1_AGIEN1_MASK                  0x00000002
#define _ADCGIRQEN1_AGIEN1_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN2_POSITION              0x00000002
#define _ADCGIRQEN1_AGIEN2_MASK                  0x00000004
#define _ADCGIRQEN1_AGIEN2_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN3_POSITION              0x00000003
#define _ADCGIRQEN1_AGIEN3_MASK                  0x00000008
#define _ADCGIRQEN1_AGIEN3_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN4_POSITION              0x00000004
#define _ADCGIRQEN1_AGIEN4_MASK                  0x00000010
#define _ADCGIRQEN1_AGIEN4_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN5_POSITION              0x00000005
#define _ADCGIRQEN1_AGIEN5_MASK                  0x00000020
#define _ADCGIRQEN1_AGIEN5_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN6_POSITION              0x00000006
#define _ADCGIRQEN1_AGIEN6_MASK                  0x00000040
#define _ADCGIRQEN1_AGIEN6_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN7_POSITION              0x00000007
#define _ADCGIRQEN1_AGIEN7_MASK                  0x00000080
#define _ADCGIRQEN1_AGIEN7_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN8_POSITION              0x00000008
#define _ADCGIRQEN1_AGIEN8_MASK                  0x00000100
#define _ADCGIRQEN1_AGIEN8_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN9_POSITION              0x00000009
#define _ADCGIRQEN1_AGIEN9_MASK                  0x00000200
#define _ADCGIRQEN1_AGIEN9_LENGTH                0x00000001

#define _ADCGIRQEN1_AGIEN10_POSITION             0x0000000A
#define _ADCGIRQEN1_AGIEN10_MASK                 0x00000400
#define _ADCGIRQEN1_AGIEN10_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN11_POSITION             0x0000000B
#define _ADCGIRQEN1_AGIEN11_MASK                 0x00000800
#define _ADCGIRQEN1_AGIEN11_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN12_POSITION             0x0000000C
#define _ADCGIRQEN1_AGIEN12_MASK                 0x00001000
#define _ADCGIRQEN1_AGIEN12_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN13_POSITION             0x0000000D
#define _ADCGIRQEN1_AGIEN13_MASK                 0x00002000
#define _ADCGIRQEN1_AGIEN13_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN14_POSITION             0x0000000E
#define _ADCGIRQEN1_AGIEN14_MASK                 0x00004000
#define _ADCGIRQEN1_AGIEN14_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN15_POSITION             0x0000000F
#define _ADCGIRQEN1_AGIEN15_MASK                 0x00008000
#define _ADCGIRQEN1_AGIEN15_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN16_POSITION             0x00000010
#define _ADCGIRQEN1_AGIEN16_MASK                 0x00010000
#define _ADCGIRQEN1_AGIEN16_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN17_POSITION             0x00000011
#define _ADCGIRQEN1_AGIEN17_MASK                 0x00020000
#define _ADCGIRQEN1_AGIEN17_LENGTH               0x00000001

#define _ADCGIRQEN1_AGIEN18_POSITION             0x00000012
#define _ADCGIRQEN1_AGIEN18_MASK                 0x00040000
#define _ADCGIRQEN1_AGIEN18_LENGTH               0x00000001

